<?php

use Illuminate\Database\Seeder;
use App\Customer;

class CustomersTableSeeder extends Seeder
{

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        // DB::table('customers')->truncate();
        $descriptions = 'אולמות לב השוכנים בקניון לב באשקלון מתגאים בעיצוב חדש, איכותי ויוקרתי מאין כמוהו
        ובהנהלה חדשה, שמעניקה למקום מניסיונה העשיר. האחים לב, המפורסמים והפעילים בתחום הפקת האירועים
        בישראל,זה זמן רב מתחייבים לסטנדרטים הכי טובים באחריות.להפיק לכם את האירוע המושלם בשבילכם.

       ב"ארמונות לב" תוכלו לערוך חתונות, אירועי בר/בת מצווה,
        בריתות, טקסי חינה, מסיבות רבות משתתפים,ועוד. המקום ממתין לשירותכם, ובמיוחד לשדרוג האירוע שלכם,
        ציוד הגברה ותאורה ברמה הגבוהה ביותר. התפריט שיוגש באירוע שלכם ייבנה בשיתוף השף המקצועי, המנוסה
        והמפורסם של המקום, ובהתאם לצרכיכם הייחודיים. האחים לב, שלהם עשרות שנות פעילות בתחום וידע עשיר
       
       בהפקת אירועים, יחד עם הצוות המארח, הידוע ביחסו
        החם ללקוחות המקום, יעניקו את כל הידע והמקצועית שלהם לכם ולאורחיכם. יחד מייצרים כל אלו תוצאה שאין
        כמותה ואירוע מושלם ובלתי נשכח! כמו כן מספקים "ארמונות לב" שירות קייטרינג משובח עם תפריט מגוון,
       
       איכותי ונהדר עם מיטב המאכלים. השירות כולל משלוח עד הבית. בשטח האולם שב"ארמונות לב" מתקיים
        בערבי חג ובימי שישי יריד מזון שבועי בו נמכרים מאכלים מובחרים וטריים ממגוון סגנונות ועדות ובכל הטעמים,
        והכול במחירים עממיים. *כל המאכלים של "ארמונות לב" בהשגחת הרבנות אשקלון וניתן לקבל גם כשרות בד"ץ.
       ';
        Customer::create([

            "user_id" =>  1,
            'company' => 'ארמונות לב',
            "businessType" => "halls events",
            "contact" => "הנהלה",
            "title" => "ארמונות לב המחודשים 2012",
            "loggo" => "./assets/pages/customers/halls-events/palace-lev/loggo/123.png",
            "descritions" => $descriptions,
            "email" => "armonotlev1@walla.com",
            "phone" => "08-6640450",
            "address" => "אשקלון, ההסתדרות 40 (קניון לב אשקלון)",
            "confirmed" => rand(0, 1),
            "deals" => "בקרוב יעודכן"
        ]);

        $descriptions = 'הנהלתו החדשה של יצחק פדידה,מציעים לכם שלושה אולמות 
        מפוארים הקרויים בשמות אבני החושן,המתאימים לכם לכל אירוע בכל סדר גודל.
        אולם ספיר-עד 180 איש.
        אולם ברקת-עד 280 איש.
        אולם יהלום-עד 600 איש.
        ';
        Customer::create([


            "user_id" =>  2,
            "company" => "בניסטל",
            "businessType" => "halls events",
            "contact" => "הנהלה",
            "title" => "ארמונות בינסטל ",
            "loggo" => "./assets/pages/customers/halls-events/benistal/loggo/benistal.jpg",
            "descritions" => $descriptions,
            "email" => "benistal23@gmil.com",
            "phone" => "08-8522668, 08822669",
            "address" => "אשדוד",
            "confirmed" => rand(0, 1),
            "deals" => "בקרוב יעודכן"
        ]);

        $descriptions = 'ולדן קראון. מרכז ארועים. 3 אולמות מפוארים עומדים לרשותכם. חתונות,
        בר מצווה, בריתות, כנסים עד 900 איש. אולם מיוחד לחינות בסגנון מרוקאי עד 250 איש. 
        
         מבצע רק לפונים דרך אתיופיה אירועים במחירים אטרקטיביים
        במיוחד בימיים הקרובים בדקו אותנו.
        
        אתיופיה אירועים לא רק מדברים עושים
        ';
        Customer::create([

            "user_id" =>  3,
            "company" =>  "גולדן",
            "businessType" => "halls events",
            "contact" =>  "הנהלה",
            "title" =>  "גולדן קראון",
            "loggo" =>  "./assets/pages/customers/halls-events/golden/loggo/golden.jpg",
            "descritions" => $descriptions,
            "email" =>  "margalit3312@wall.com",
            "phone" =>  "08-8566070, 057-3109340",
            "address" => "אשדוד,רחוב האורגים-16",
            "confirmed" => rand(0, 1),
            "deals" =>  "בקרוב יעודכן"
        ]);

        $descriptions = 'סילבר...אולם אירועים ששודרג זה עתה לפי מיטב הקידמה והטכנולוגיה,בכירי
        האדריכלים השקיעו מאמצים רבים על מנת להפוך את המקום למקום חוותי.מתחם קבלת הפנים תוכנן
        ועוצב להעניק לראשוני האורחים חווית אירוח ברוח חדשה.התאורה ,המטעמים,הרהיטים 
        והצוות המקצועי כל אלה נבחרו בקפידה בכדי לחמם את תחילת האירוע ולהזרימו לאולם המרכזי.
        "פשוט עוצר נשימה" silver
        
        מבצע רק לפונים דרך אתיופיה אירועים במחירים אטרקטיביים
        במיוחד בימיים קרוביםת בדקו אותנו
        
        אתיופיה אירועים לא רק מדברים עושים
        ';

        Customer::create([

            "user_id" =>  4,
            "company" => "סילבר",
            "businessType" => "halls events",
            "contact" => "הנהלה",
            "title" => "סילבר אירועים ",
            "loggo" => "./assets/pages/customers/halls-events/silver/loggo/silver.jpg",
            "descritions" => $descriptions,
            "email" => "fakeEmail@kjk.com",
            "phone" => "08-6722256 ,077-270789",
            "address" => "צומת סילבר ,אשקלון",
            "confirmed" => rand(0, 1),
            "deals" => "בקרוב יעודכן"
        ]);
    }
}
