<?php

use Illuminate\Database\Seeder;
use App\Article;
use Carbon\Carbon;

class generete_article_table extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $article = Article::create([
            'title' => 'הפוסט הראשון',
            'body' => 'צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. '
            . 'קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן מנת. לפרומי בלוף קינץ תתיח לרעח. לת צשחמי צש בליא, מנסוטו צ'
            . 'מלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קולורס'
            . ' מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף גולר מונפרר סוברט  שבצק יהול, לכנוץ בעריר גק ליץ,'
            . ' נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון'
            . ' בלרק - וענוף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש.'
            . ' תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.  לורם איפסום דולור סיט אמט, קולהע צופעט למרקו', 
            'user_id' => 1,
            'published_at' => Carbon::now()
        ]);
        $article = Article::create([
            'title' => 'הפוסט השני שלי',
            'body' => 'צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. '
            . 'קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן מנת. לפרומי בלוף קינץ תתיח לרעח. לת צשחמי צש בליא, מנסוטו צ'
            . 'מלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קולורס'
            . ' מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף גולר מונפרר סוברט  שבצק יהול, לכנוץ בעריר גק ליץ,'
            . ' נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון'
            . ' בלרק - וענוף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש.'
            . ' תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.  לורם איפסום דולור סיט אמט, קולהע צופעט למרקו', 
            'user_id' => 2,
            'published_at' => Carbon::now()
        ]);
        $article = Article::create([
            'title' => 'הפוסט השלישי שלי',
            'body' => 'צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. '
            . 'קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן מנת. לפרומי בלוף קינץ תתיח לרעח. לת צשחמי צש בליא, מנסוטו צ'
            . 'מלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קולורס'
            . ' מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף גולר מונפרר סוברט  שבצק יהול, לכנוץ בעריר גק ליץ,'
            . ' נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון'
            . ' בלרק - וענוף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש.'
            . ' תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.  לורם איפסום דולור סיט אמט, קולהע צופעט למרקו', 
            'user_id' => 3,
            'published_at' => Carbon::now()
        ]);
        
    }
}
